wegam/STM32F1xWorkSpace/Examples/WOW/AMP_CAB.C
#include "AMP_CAB.H"


#include "AMP01.H"

#include	"AMP_PHY.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"

#include "SWITCHID.H"

#include 	"CRC.H"

#include "string.h"				//串和内存操作函数头文件


RS485Def stCbRS485Ly;   //usart2,pa1    //层板接口
RS485Def stCbRS485Cb;   //uart4,pc12    //副柜接口
SwitchDef stCbSwitch;

unsigned char CabAddr   =0;
unsigned char MainFlag  =0; //0--副柜，1--主柜

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_Configuration(void)
{	
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	
  
  AMPCABSwitchID_Configuration();
  
  AMPCAB_GenyConfiguration();   //常规接口配置，背光，锁，电源控制
    
  AMPCABCOMM_Configuration();   //通讯配置
 
//	PWM_OUT(TIM2,PWM_OUTChannel1,1000,950); //PWM设定-20161127版本  
//  IWDG_Configuration(1000);							  //独立看门狗配置---参数单位ms
//  SysTick_Configuration(1000);            //系统嘀嗒时钟配置72MHz,单位为uS
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_Server(void)
{
  LockServer();
  RequestServer();    //请求命令处理
  StatusServer();     //状态服务
  AMPCAB_SwitchIDServer();
  AMPCAB_SYSLED();
  AMPCAB_BackLight();
}
/*******************************************************************************
*函数名			:	MainBoard_Server
*功能描述		:	主柜空闲服务程序
              1-查询在线设备
              2-查询副柜有无数据上传
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_Loop(void)
{  
  AMPCAB_Receive();
  Send_Server();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_Receive(void)
{
  unsigned short RxNum  = 0;
  unsigned char rxd[256]={0};
  //==========================================================接收查询
  //---------------------PC接口 USART1
  RxNum = USART_ReadBufferIDLE(USART1,rxd);
  if(RxNum)
  {
    Msg_ProcessCB(PcPort,rxd,RxNum);                //柜消息处理
  }
  //---------------------副柜接口 UART4
  RxNum = RS485_ReadBufferIDLE(&stCbRS485Cb,rxd);
  if(RxNum)
  {
    Msg_ProcessCB(CabPort,rxd,RxNum);
  }  
  //---------------------层板接口 USART2
  RxNum = RS485_ReadBufferIDLE(&stCbRS485Ly,rxd);
  if(RxNum)
  {
    Msg_ProcessCB(LayPort,rxd,RxNum);              //柜消息处理
  }
  //---------------------读卡器接口 USART3
  RxNum = USART_ReadBufferIDLE(USART3,rxd);
  if(RxNum)
  {
    Msg_ProcessCB(CardPort,rxd,RxNum);
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_SwitchIDServer(void)
{
  unsigned char cabaddrbac=CabAddr;
  if(0==AMPPro.Time.swicthidtime)
  {
    CabAddr  = SWITCHID_ReadLeft(&stCbSwitch)&0x3F;
  
    if(SWITCHID_ReadLeft(&stCbSwitch)&0x80)
    {
      MainFlag=1; //0--副柜，1--主柜
    }
    else
    {
      MainFlag=0; //0--副柜，1--主柜
    }
    if(cabaddrbac!=CabAddr)
    {
      AMPCABCOMM_Configuration();   //通讯配置
    }
  }
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AMPCAB_SYSLED(void)
{
  if(0==AMPPro.Time.SYSLEDTime)
  {    
    GPIO_Toggle	(SYSLEDPort,SYSLEDPin);		//将GPIO相应管脚输出翻转----V20170605
    if(CabAddr)   //已拨码，频率1Hz
    {
      AMPPro.Time.SYSLEDTime=500;
    }
    else          //未拨码，频率5Hz
    {
      AMPPro.Time.SYSLEDTime=100;
    }
  }
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void AMPCAB_BackLight(void)
{
  static unsigned short BLtime=0;
  if(0==CabAddr)   //未拨码
  {    
    if(BLtime++>200)
    {
      BLtime=0;
      GPIO_Toggle	(BackLightPort,BackLightPin);		//将GPIO相应管脚输出翻转----V20170605
    }
    return;
  }
  if(AMPPro.Req.BLon)      //背光开关控制
  {
    BackLightOn;
    AMPPro.Req.BLon=0;
  }
  else if(AMPPro.Req.BLoff)
  {
    BackLightOff;
    AMPPro.Req.BLoff=0;
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void LockServer(void)
{
    //-----------------------------------未拨码自动开锁
    if(0  ==  CabAddr)    //未拨码--自动开锁
    {
      if(GetLockSts)  //如果锁为关闭状态，则开锁
      {
        UnLock;
      }
      else
      {
        ResLock;
      }
      return;
    }
    //-----------------------------------正在执行开锁动作
    if(1==AMPPro.Req.unlockrun)   //正在执行开锁动作
    {
      if(AMPPro.Time.LockTime>unlockOuttime-10)//10ms后开始检查锁状态
      {
        return;
      }
      if(GetLockSts)    //锁未开
      {
        AMPPro.Sta.lockstd  = 1;    //锁状态为ON--锁住
        if(AMPPro.Time.LockTime==0) //超过开锁时间
        {
          AMPPro.Req.unlockrun  = 0;  //开锁标志关闭
          AMPPro.Sta.unlockerr  = 1;  //开锁异常
          AMPPro.Time.LockTime  = 0;  //开锁时间清除
          ResLock;
        }
      }
      //----------------------------锁已打开，需要延时关闭锁驱动
      else
      {
        if(0==AMPPro.Req.reslockqust) //延时释放锁驱动
        {
          AMPPro.Req.reslockqust  = 1;  //释放锁驱动请求
          AMPPro.Time.LockTime    = reslockdelaytime;  //延时Nms
        }
        else
        {
          if(0==AMPPro.Time.LockTime)//延时计时时间到
          {
            AMPPro.Sta.lockstd    = 0;  //锁状态为打开
            AMPPro.Req.unlockrun  = 0;
            AMPPro.Req.reslockqust= 0;  //释放锁驱动请求标志清除
            AMPPro.Sta.unlockerr  = 0;
            AMPPro.Time.LockTime  = 0;
            ResLock;
          }
        }                
      }      
    }
    //-----------------------------------有开锁请求时数据处理
    if(1==AMPPro.Req.unlockqust)  //开锁请求
    {
      AMPPro.Req.unlockrun  = 1;
      AMPPro.Req.unlockqust = 0;
      AMPPro.Req.reslock    = 0;
      AMPPro.Req.reslockqust=0;   //释放锁驱动请求标志清除
      AMPPro.Sta.unlockerr  = 0;
      
      
      AMPPro.Req.BLon=1;   //开锁需要开背光
      AMPPro.Req.PLon=1;   //开锁层板需要供电
      
      AMPPro.Time.LockTime   = unlockOuttime;    //开锁超时倒计时时间
      UnLock;
    }
    
    //-----------------------------关锁动作
    if(GetLockSts)    //锁未开
    {
      //检查是否为关锁动作
      if(0==AMPPro.Sta.lockstd)//原状态为锁已打开
      {
        AMPPro.Req.BLoff = 1;  //请求关背光
        AMPPro.Req.PLoff = 1;  //请求关闭层板电源
        AMPPro.Flag.LayPownOn=0; 
      }
      AMPPro.Sta.lockstd  = 1;
    }
    else
    {
      if(1==AMPPro.Sta.lockstd) //原状态锁为关闭---手动开锁
      {
        AMPPro.Req.BLon = 1;  //请求打开背光
        AMPPro.Req.PLon = 1;  //请求打开层板电源
        AMPPro.Flag.LayPownOn=1;
      }
      AMPPro.Sta.lockstd  = 0;
    }
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void AMPCABSwitchID_Configuration(void)
{
  stCbSwitch.NumOfSW	=	8;
  
  stCbSwitch.SW1_PORT	=	GPIOC;
  stCbSwitch.SW1_Pin	=	GPIO_Pin_0;
  
  stCbSwitch.SW2_PORT	=	GPIOC;
  stCbSwitch.SW2_Pin	=	GPIO_Pin_1;
  
  stCbSwitch.SW3_PORT	=	GPIOC;
  stCbSwitch.SW3_Pin	=	GPIO_Pin_2;
  
